//
// Created by Sophie on 06/07/2021.
//

#ifndef RRSPY2TESTAPP_STATICOBJECT_H
#define RRSPY2TESTAPP_STATICOBJECT_H

#include "DFCNode.h"

class StaticObject : DFCNode {
public:
	unsigned int unk_0; // 0x6c
	unsigned int unk_1; // 0x70
	unsigned int unk_2; // 0x74
	unsigned int unk_3; // 0x78
	unsigned int unk_4; // 0x7c
	unsigned int unk_5; // 0x80
	unsigned int unk_6; // 0x84
	unsigned int unk_7; // 0x88
	unsigned int unk_8; // 0x8c
	unsigned int unk_9; // 0x90
	unsigned int unk_10; // 0x94
	unsigned int unk_11; // 0x98
	unsigned int unk_12; // 0x9c
	unsigned int unk_13; // 0xa0
	unsigned int unk_14; // 0xa4
	unsigned int unk_15; // 0xa8
	unsigned int unk_16; // 0xac
	unsigned int unk_17; // 0xb0
	unsigned int unk_18; // 0xb4
	unsigned int unk_19; // 0xb8
	unsigned int unk_20; // 0xbc
	unsigned int unk_21; // 0xc0
	unsigned int unk_22; // 0xc4
	unsigned int unk_24; // 0xcc
	unsigned int unk_25; // 0xd0
	unsigned int unk_26; // 0xd4
	unsigned int unk_27; // 0xd8
	unsigned int unk_28; // 0xdc
	unsigned int unk_29; // 0xe0
	unsigned int unk_30; // 0xe4
	unsigned int unk_31; // 0xe8
	unsigned int unk_32; // 0xec
	unsigned int unk_33; // 0xf0
	unsigned int unk_34; // 0xf4
/**
 * debug475:14B91664     dd 0FFFF445Bh
debug475:14B91668     dd 851Bh
debug475:14B9166C     dd 0
debug475:14B91670     dd 0
debug475:14B91674     dd 0
debug475:14B91678     dd 0FFFC227Ch
debug475:14B9167C     dd 0FFFCF65Bh
debug475:14B91680     dd 301Bh
debug475:14B91684     dd 0C07Ch
debug475:14B91688     dd offset unk_1585B
debug475:14B9168C     dd 0EA1Bh
debug475:14B91690     dd 0C3C74200h
debug475:14B91694     dd 0C358A500h
debug475:14B91698     dd 430D1B00h
debug475:14B9169C     dd 444D4C00h
debug475:14B916A0     dd 0
debug475:14B916A4     dd 0BAADF00Dh
debug475:14B916A8     dd offset off_134971C8
debug475:14B916AC     dd 0F0h
debug475:14B916B0     dd 0BAADF00Dh
debug475:14B916B4     dd offset off_14B870F0
debug475:14B916B8     dd offset off_14B88738
debug475:14B916BC     dd 0ADABh
debug475:14B916C0     dd 0BAADF048h
debug475:14B916C4     dd offset off_14B88650
debug475:14B916C8     dd offset off_14D30038
debug475:14B916CC     dd offset off_14B861E8
debug475:14B916D0     dd offset off_132A67A0
debug475:14B916D4     dd 0FFFFFFFFh
debug475:14B916D8     dd 0ABABABABh
debug475:14B916DC     dd 0ABABABABh
debug475:14B916E0     dd 0
debug475:14B916E4     dd 0
debug475:14B916E8     dd 7BD4DDA2h
debug475:14B916EC     dd offset unk_18433EC9
 */
};


#endif //RRSPY2TESTAPP_STATICOBJECT_H
